## Terraform Plan Results - dev

<details>
<summary>Show Plan</summary>

```terraform
data.aws_route53_zone.main: Reading...
data.aws_iam_openid_connect_provider.github[0]: Reading...
data.aws_route53_zone.main: Read complete after 0s [id=Z05276233GKBL62MKYJTK]
data.aws_iam_openid_connect_provider.github[0]: Read complete after 0s [id=arn:aws:iam::456808212788:oidc-provider/token.actions.githubusercontent.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.website will be created
  + resource "aws_acm_certificate" "website" {
      + arn                       = (known after apply)
      + domain_name               = "dev.thomfilg.com"
      + domain_validation_options = [
          + {
              + domain_name           = "dev.thomfilg.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dev.thomfilg.com",
        ]
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "thomfilg-portfolio"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.website will be created
  + resource "aws_acm_certificate_validation" "website" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.certificate_validation["dev.thomfilg.com"] will be created
  + resource "aws_route53_record" "certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05276233GKBL62MKYJTK"
    }

  # aws_s3_bucket_policy.website_policy will be created
  + resource "aws_s3_bucket_policy" "website_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.website will be created
  + resource "aws_cloudfront_distribution" "website" {
      + aliases                         = (known after apply)
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "thomfilg-portfolio dev distribution"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "thomfilg-portfolio"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = (known after apply)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.website will be created
  + resource "aws_cloudfront_origin_access_control" "website" {
      + arn                               = (known after apply)
      + description                       = "Origin Access Control for thomfilg-portfolio dev"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "thomfilg-portfolio-dev-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.iam.aws_iam_policy.s3_deployment[0] will be created
  + resource "aws_iam_policy" "s3_deployment" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for S3 deployment access"
      + id               = (known after apply)
      + name             = "thomfilg-portfolio-dev-s3-deployment"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "thomfilg-portfolio"
        }
    }

  # module.iam.aws_iam_role.github_actions[0] will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:tigredonorte/thommf-portfolio:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::456808212788:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "thomfilg-portfolio-dev-github-actions"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "thomfilg-portfolio"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.github_actions_s3[0] will be created
  + resource "aws_iam_role_policy_attachment" "github_actions_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thomfilg-portfolio-dev-github-actions"
    }

  # module.route53.aws_route53_record.subdomain will be created
  + resource "aws_route53_record" "subdomain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.thomfilg.com"
      + type            = "A"
      + zone_id         = "Z05276233GKBL62MKYJTK"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.s3_website.aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "thomfilg-portfolio-dev-website"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "thomfilg-portfolio"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_website.aws_s3_bucket_public_access_block.website will be created
  + resource "aws_s3_bucket_public_access_block" "website" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_website.aws_s3_bucket_server_side_encryption_configuration.website will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_website.aws_s3_bucket_versioning.website will be created
  + resource "aws_s3_bucket_versioning" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_website.aws_s3_object.index will be created
  + resource "aws_s3_object" "index" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thomfilg-portfolio-dev-website"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            <!DOCTYPE html>
            <html>
            <head>
                <title>Coming Soon</title>
                <style>
                    body { font-family: Arial, sans-serif; text-align: center; margin-top: 50px; }
                    h1 { color: #333; }
                </style>
            </head>
            <body>
                <h1>Coming Soon</h1>
                <p>This site is under construction.</p>
            </body>
            </html>
        EOT
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "thomfilg-portfolio"
        }
      + version_id             = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudfront_distribution_id = (known after apply)
  + cloudfront_domain_name     = (known after apply)
  + github_actions_role_arn    = (known after apply)
  + route53_zone_id            = "Z05276233GKBL62MKYJTK"
  + s3_bucket_name             = (known after apply)
  + website_url                = "https://dev.thomfilg.com"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"

```

</details>